#TODO 把YiIntList和JiaZiList改写为六十四卦类和六十甲子类。

YiIntList = [
    '坤','剥','比','观','豫','晋','萃','否',
    '谦','艮','蹇','渐','小过','旅','咸','遁',
    '师','蒙','坎','涣','解','既济','困','讼',
    '升','蛊','井','巽','恒','鼎','大过','姤',
    '复','颐','屯','益','震','噬嗑','随','无妄',
    '明夷','贲','未济','家人','丰','离','革','同人',
    '临','损','节','中孚','归妹','睽','兑','履',
    '泰','大畜','需','小畜','大壮','大有','夬','乾'
]



JiaZiList = [
    '甲子',
    '乙丑',
    '丙寅',
    '丁卯',
    '戊辰',
    '己巳',
    '庚午',
    '辛未',
    '壬申',
    '癸酉',
    '甲戌',
    '乙亥',
    '丙子',
    '丁丑',
    '戊寅',
    '己卯',
    '庚辰',
    '辛巳',
    '壬午',
    '癸未',
    '甲申',
    '乙酉',
    '丙戌',
    '丁亥',
    '戊子',
    '己丑',
    '庚寅',
    '辛卯',
    '壬辰',
    '癸巳',
    '甲午',
    '乙未',
    '丙申',
    '丁酉',
    '戊戌',
    '己亥',
    '庚子',
    '辛丑',
    '壬寅',
    '癸卯',
    '甲辰',
    '乙巳',
    '丙午',
    '丁未',
    '戊申',
    '己酉',
    '庚戌',
    '辛亥',
    '壬子',
    '癸丑',
    '甲寅',
    '乙卯',
    '丙辰',
    '丁巳',
    '戊午',
    '己未',
    '庚申',
    '辛酉',
    '壬戌',
    '癸亥',
]




#TODO 把TiaGanList和DiZhiList和JieQiList改写为天干类和地支类和节气类。

TiaGanList = ['甲' , '乙' , '丙' , '丁' , '戊' , '己' , '庚' , '辛' , '壬' , '癸']
DiZhiList = ['子' , '丑' , '寅' , '卯' , '辰' , '巳' , '午' , '未' , '申' , '酉' , '戌' , '亥']
JieQiList = ['立春' , '雨水' , '惊蛰' , '春分' , '清明' , '谷雨' ,
            ,立夏' , '小满' , '芒种' , '夏至' , '小暑' , '大暑' ,
            ,立秋' , '处暑' , '白露' , '秋分' , '寒露' , '霜降' ,
            ,立冬' , '小雪' , '大雪' , '冬至' , '小寒' , '大寒'
            ]





